<a href="https://colab.research.google.com/github/kay-kay-t/CodingDojo/blob/main/02_SQL_Exercise.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<center>
<img src="https://course_report_production.s3.amazonaws.com/rich/rich_files/rich_files/2470/s300/cd-logo-blue-600x600.png" alt="Coding Dojo Logo" class="center" height="50">

# SQL Exercises

*Make a copy of this notebook to edit!*
```
File > Save a copy in Drive
```
    
</center>

[SQLAlchemy](https://www.sqlalchemy.org/) is a wrapper for Python that allows us to write SQL queries in Python. We will use this to practice our SQL basics in Python.

First, we need to connect to a database. We will just read a table into SQL for this step. We will be creating a [SQLite](https://sqlite.org/index.html) database and loading two tables ([table 1](https://drive.google.com/file/d/18MgOmIHHafoubgp2d_7GM6GWroxb0vPe/view?usp=sharing)  and [table 2](https://drive.google.com/file/d/1lqW6qfPXpDWsQ6yMYpZPX7brVif-v_Ra/view?usp=sharing)) into that database.

The data (from [this source](https://data.world/sikkim/school)) describes details of various schools.

In [2]:
# imports
import pandas as pd
from sqlalchemy import create_engine

In [1]:
# mount data
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
# load table 1
school = pd.read_csv('/content/drive/MyDrive/Data/School_Details.csv')
school.head(2)

  DistrictName EstablishmentCode  ... HighestClass BoardName
0         East             S0169  ...      Class 5       NaN
1         East             S0099  ...     Class 12  C.B.S.E.

[2 rows x 30 columns]

In [4]:
school.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1249 entries, 0 to 1248
Data columns (total 30 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   DistrictName                1249 non-null   object
 1   EstablishmentCode           1249 non-null   object
 2   EstablishmentName           1249 non-null   object
 3   BRCName                     1249 non-null   object
 4   CRCName                     1249 non-null   object
 5   SchoolLevel                 1246 non-null   object
 6   ManagementName              1246 non-null   object
 7   LocalityHabitation          1221 non-null   object
 8   SubdivisionName             1241 non-null   object
 9   ConstituencyName            1249 non-null   object
 10  RevenueBlockName            1249 non-null   object
 11  CivicBodyName               1249 non-null   object
 12  WardName                    1249 non-null   object
 13  PostOfficeName              1249 non-null   object
 14  PhoneNo                     794 non-null    object
 15  FaxNo                       20 non-null     object
 16  EmailID                     182 non-null    object
 17  Website                     24 non-null     object
 18  LocatedInRuralOrUrban       1249 non-null   object
 19  DiseCode                    439 non-null    object
 20  EstablishedDate             1230 non-null   object
 21  DistrictHQDistance (in Km)  1246 non-null   float64
 22  CRCDistance (in Km)         1246 non-null   float64
 23  BACDistance (in Km)         1246 non-null   float64
 24  IsRecognized                1246 non-null   object
 25  RecognizedBy                1004 non-null   object
 26  ContactPersonName           0 non-null      float64
 27  LowestClass                 1246 non-null   object
 28  HighestClass                1246 non-null   object
 29  BoardName                   784 non-null    object
dtypes: float64(4), object(26)
memory usage: 292.9+ KB

In [5]:
# load table 2
facility = pd.read_csv('/content/drive/MyDrive/Data/School Facility Details.csv')
facility.head(2)

  EstablishmentCode  ... IsSportsStoreRoomAvailable
0             S1034  ...              Not Available
1             S0516  ...              Not Available

[2 rows x 11 columns]

In [6]:
facility.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1256 entries, 0 to 1255
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   EstablishmentCode           1256 non-null   object
 1   EstablishmentName           1256 non-null   object
 2   IsLibraryAvailable          1256 non-null   object
 3   AvailableBooksCount         1256 non-null   int64
 4   IsFireExtgAvailable         1256 non-null   object
 5   ExtinguisherCount           1256 non-null   int64
 6   HOIRoomAvailable            1256 non-null   object
 7   IsStaffRoomAvailable        1256 non-null   object
 8   NoofStaffRoom               1256 non-null   int64
 9   IsLockerForStaffAvailable   1256 non-null   object
 10  IsSportsStoreRoomAvailable  1256 non-null   object
dtypes: int64(3), object(8)
memory usage: 108.1+ KB

In [7]:
# create sqlite engine
engine = create_engine('sqlite:///school.db', echo=True)
# create connection to engine
conn = engine.connect()

In [ ]:
# add the dataframe as a table in sqlite
sqlite_table = "school_details"
school.to_sql(sqlite_table, conn, if_exists='fail')

sqlite_table2 = "school_facility_details"
facility.to_sql(sqlite_table2, conn, if_exists='fail')

## Aggregates

1. What is the average BACDistance (in Km)? Rename the ouptut column to "avg_bac_distance."

In [9]:
# Write your SQL query in this string
sql = """
SELECT AVG("BACDistance (in Km)") AS avg_bac_distance
FROM school_details
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-11-18 21:58:51,563 INFO sqlalchemy.engine.Engine
SELECT AVG("BACDistance (in Km)") AS avg_bac_distance
FROM school_details

2021-11-18 21:58:51,566 INFO sqlalchemy.engine.Engine [raw sql] ()

   avg_bac_distance
0         12.681822

## GROUP BY

2. What is the average BACDistance (in Km) by School Level? Sort the results from highest average to lowest average.

In [10]:
# Write your SQL query in this string
sql = """
SELECT AVG("BACDistance (in Km)") AS avg_bac_distance
FROM school_details
GROUP BY SchoolLevel
ORDER BY avg_bac_distance DESC
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-11-18 21:58:54,011 INFO sqlalchemy.engine.Engine
SELECT AVG("BACDistance (in Km)") AS avg_bac_distance
FROM school_details
GROUP BY SchoolLevel
ORDER BY avg_bac_distance DESC

2021-11-18 21:58:54,020 INFO sqlalchemy.engine.Engine [raw sql] ()

   avg_bac_distance
0         13.692647
1         12.830787
2         12.630872
3         10.863095
4          5.368421

## Having

3. Repeat the previous query, but only display results where the average distance is at least 10 km.

In [11]:
# Write your SQL query in this string
sql = """
SELECT AVG("BACDistance (in Km)") AS avg_bac_distance
FROM school_details
GROUP BY SchoolLevel
HAVING avg_bac_distance >= 10
ORDER BY avg_bac_distance DESC
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-11-18 21:58:57,171 INFO sqlalchemy.engine.Engine
SELECT AVG("BACDistance (in Km)") AS avg_bac_distance
FROM school_details
GROUP BY SchoolLevel
HAVING avg_bac_distance >= 10
ORDER BY avg_bac_distance DESC

2021-11-18 21:58:57,175 INFO sqlalchemy.engine.Engine [raw sql] ()

   avg_bac_distance
0         13.692647
1         12.830787
2         12.630872
3         10.863095

## Joins

4. Join the two tables together (school_details and school_details). Start by displaying all of the columns, but limit the resulting rows to just 2.

In [12]:
# Write your SQL query in this string
sql = """
SELECT *
FROM school_details s INNER JOIN school_facility_details f
  ON s.EstablishmentCode = f.EstablishmentCode
LIMIT 2
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-11-18 21:58:59,821 INFO sqlalchemy.engine.Engine
SELECT *
FROM school_details s INNER JOIN school_facility_details f
  ON s.EstablishmentCode = f.EstablishmentCode
LIMIT 2

2021-11-18 21:58:59,830 INFO sqlalchemy.engine.Engine [raw sql] ()

   index DistrictName  ... IsLockerForStaffAvailable IsSportsStoreRoomAvailable
0      0         East  ...             Not Available              Not Available
1      1         East  ...             Not Available                  Available

[2 rows x 43 columns]

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 43 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   index                       2 non-null      int64
 1   DistrictName                2 non-null      object
 2   EstablishmentCode           2 non-null      object
 3   EstablishmentName           2 non-null      object
 4   BRCName                     2 non-null      object
 5   CRCName                     2 non-null      object
 6   SchoolLevel                 2 non-null      object
 7   ManagementName              2 non-null      object
 8   LocalityHabitation          2 non-null      object
 9   SubdivisionName             2 non-null      object
 10  ConstituencyName            2 non-null      object
 11  RevenueBlockName            2 non-null      object
 12  CivicBodyName               2 non-null      object
 13  WardName                    2 non-null      object
 14  PostOfficeName              2 non-null      object
 15  PhoneNo                     1 non-null      object
 16  FaxNo                       0 non-null      object
 17  EmailID                     0 non-null      object
 18  Website                     0 non-null      object
 19  LocatedInRuralOrUrban       2 non-null      object
 20  DiseCode                    1 non-null      object
 21  EstablishedDate             2 non-null      object
 22  DistrictHQDistance (in Km)  2 non-null      float64
 23  CRCDistance (in Km)         2 non-null      float64
 24  BACDistance (in Km)         2 non-null      float64
 25  IsRecognized                2 non-null      object
 26  RecognizedBy                2 non-null      object
 27  ContactPersonName           0 non-null      object
 28  LowestClass                 2 non-null      object
 29  HighestClass                2 non-null      object
 30  BoardName                   1 non-null      object
 31  index                       2 non-null      int64
 32  EstablishmentCode           2 non-null      object
 33  EstablishmentName           2 non-null      object
 34  IsLibraryAvailable          2 non-null      object
 35  AvailableBooksCount         2 non-null      int64
 36  IsFireExtgAvailable         2 non-null      object
 37  ExtinguisherCount           2 non-null      int64
 38  HOIRoomAvailable            2 non-null      object
 39  IsStaffRoomAvailable        2 non-null      object
 40  NoofStaffRoom               2 non-null      int64
 41  IsLockerForStaffAvailable   2 non-null      object
 42  IsSportsStoreRoomAvailable  2 non-null      object
dtypes: float64(3), int64(5), object(35)
memory usage: 816.0+ bytes

5. Now, select just the schools where the SchoolLevel is "PS" that do not have libraries.

In [14]:
# Write your SQL query in this string
sql = """
SELECT s.EstablishmentName, s.SchoolLevel, f.IsLibraryAvailable 
FROM school_details s INNER JOIN school_facility_details f
  ON s.EstablishmentCode = f.EstablishmentCode
WHERE s.SchoolLevel = "PS" AND f.IsLibraryAvailable = 'Not Available'
"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-11-18 21:59:05,827 INFO sqlalchemy.engine.Engine
SELECT s.EstablishmentName, s.SchoolLevel, f.IsLibraryAvailable
FROM school_details s INNER JOIN school_facility_details f
  ON s.EstablishmentCode = f.EstablishmentCode
WHERE s.SchoolLevel = "PS" AND f.IsLibraryAvailable = 'Not Available'

2021-11-18 21:59:05,830 INFO sqlalchemy.engine.Engine [raw sql] ()

                        EstablishmentName SchoolLevel IsLibraryAvailable
0        EASWARAMMA SAI GURUKOOL ACCADEMY          PS      Not Available
1     NEW GARDEN BOARDING SCHOOL (SAJONG)          PS      Not Available
2     SARASWATI SHISHU VIDHYALAYA, BUDANG          PS      Not Available
3        SAWNEY GOVERNMENT PRIMARY SCHOOL          PS      Not Available
4  UPPER PACHAK GOVERNMENT PRIMARY SCHOOL          PS      Not Available

6. Build off the previous query, but order the results alphabetically by name.

In [15]:
# Write your SQL query in this string
sql = """
SELECT s.EstablishmentName, s.SchoolLevel, f.IsLibraryAvailable 
FROM school_details s INNER JOIN school_facility_details f
  ON s.EstablishmentCode = f.EstablishmentCode
WHERE s.SchoolLevel = "PS" AND f.IsLibraryAvailable = 'Not Available'
ORDER BY s.EstablishmentName

"""

# Read the sql query into pandas to view the results
df = pd.read_sql_query(sql, engine)
df.head()

2021-11-18 21:59:08,431 INFO sqlalchemy.engine.Engine
SELECT s.EstablishmentName, s.SchoolLevel, f.IsLibraryAvailable
FROM school_details s INNER JOIN school_facility_details f
  ON s.EstablishmentCode = f.EstablishmentCode
WHERE s.SchoolLevel = "PS" AND f.IsLibraryAvailable = 'Not Available'
ORDER BY s.EstablishmentName


2021-11-18 21:59:08,433 INFO sqlalchemy.engine.Engine [raw sql] ()

                                   EstablishmentName  ... IsLibraryAvailable
0  (I.E.C) INDIAN EVANGALISTIC CRUSADE MISSION PR...  ...      Not Available
1                10TH MILE GOVERNMENT PRIMARY SCHOOL  ...      Not Available
2                  AAPGAZI GOVERNMENT PRIMARY SCHOOL  ...      Not Available
3                AARUBOTEY GOVERNMENT PRIMARY SCHOOL  ...      Not Available
4              AHO-YANGTAM GOVERNMENT PRIMARY SCHOOL  ...      Not Available

[5 rows x 3 columns]

In [16]:
# Close the database connection
conn.close()